let allProfileImages = [
    '../dist/assets/landing-page/elderly-nurse/avatars/profile-1.jpg',
    '../dist/assets/landing-page/elderly-nurse/avatars/profile-2.jpg',
    '../dist/assets/landing-page/elderly-nurse/avatars/profile-4.jpg',
    '../dist/assets/landing-page/elderly-nurse/avatars/profile-5.jpg',
];

let commentSliderWrapper = document.querySelector('.comment-swiper-slider');

let allComments = [
    {
        id:1,
        name:'فرید تاجمیری',
        des:'سلام بنده نزدیک به یک سالی هست که با پرستاری که برای بار اول فرستاید دارم کار میکنم . بنده شاغلم و متاسفانه همسرم یکی دو سال بعد از بدنیا دخترم از دنیا رفت . بنابراین نمیتونستم از دخترم مدام مراقبت کنم و شبانه روز بالا سرش باشم و وقتایی که سرکار بودم میسپاردمش به پدر و مادرم . بعد یه مدت تعریفتون بین همکاران شنیدم و تصمیم گرفتم برای نگهداری از دخترم وقتایی که بنده نیستم پرستار بگیرم . تمام شرایط و خواسته هایی که از پرستاری که قرار بود برام بفرستید داشتم مو به مو اجرا شد . به شخصه از اخلاق و طرز رفتار پرستار خیلی خوشم اومد نزدیک یک سالی هست باهمون پرستار اولی که فرستاده بودید دارم کار میکنم و راضیم واقعا ـ با تشکر از مجموعه خوبتون .',
    },
    {
        id:2,
        name:'علی نعمتی',
        des:'بنده مشتری ۵ ساله پارسیان کلین هستم و در این مدت که از خدمات این شرکت استفاده میکردم واقعا راضی بودم و واقعا کادر بسیار دلسوز و مهربان و بسیاری کار بلد حرفه ای برای نگهداری اعزام میکنند ، از کیفیت خدمات اولین پرستاری که برای بنده ارسال کردند بسیار راضی بودم و تصمیم گرفتم تا به صورت دائم از خدمات همین شرکت استفاده کنم.',
    },
    {
        id:3,
        name:'زهرا نوربخش',
        des:'با سلام و عرض خسته نباشید بنده میخواستم از خدمات بسیار خوب پاکیزه کاران تشکر ویژه کنم . در این مدتی که بنده به دلیل شغلی که دارم و مدام برای ماموریت در حال رفت و آمد و سفر بودم ، پرستاری که از پاکیزه کاران برای مراقبت از مادرم استخدام کردم بسیار صبور و دلسوزانه از مادر بنده ب تمام وجود مواظبت کردند. ممونم ازتون.',
    },
    {
        id:4,
        name:'سوگل امینی نظری',
        des:'سلام خسته نباشید . خواهر بنده به خاطر شغلی که داشت خیلی وقت ها خونه نبود و مجبور بود بچه هاشو بزاره پیش دوستش و یا خانواده ی همسرش ، الان نزدیک به 6 ماهی هست که از شما پرستار کودک گرفته و خیلی راضیه واقعا من خودم قبلا از خدماتتون استفاده کردم شما رو بهش معرفی کرده بودم الان دعام میکنه همش ممونم از کیفیت خدماتتون . همچنین ممونم از کیفیتو و سرعت پاسخگویی کارشناسانتون.',
    },
    {
        id:5,
        name:'ریحانه سلیمانی',
        des:'سلام خسته نباشد ، برادر بنده متاسفانه طی تصادفی که داشت مجبور به انجام عمل های متعددی شده بود بنابراین بعد از عمل و گذراندن دوران درمان و بهبودیش نمیتونست حتی به درستی راه بره و از پس خودش بربیاد و ما هم به دلیل مشغله های کاری نمیتونستم به خوبی ازش مراقبت کنیم من از طریق یکی از همکاران با مجموعه شما اشنا شدم و همون بار اولی که برای برادرم پرستار فرستادید واقعا تا تموم شدن دوران بهبودیش که تقریبا شش ماه بود راضی بودم – ممنونم از خدمات خوبتون .',
    },
    {
        id:6,
        name:'فرهاد گل محمدی',
        des:'بنده نزدیک به ۳ سالی هست که از خدمات پرستاری پاکیزه کاران پارسیان استفاده میکنم و واقعا راضیم . اولین بار برای پدرم که هم مریض بود و هم به دلیل کهولت سن توانایی انجام کار های روزمره خودش رو هم نداشت از مجموعه پارسیان پرستار گرفتم متاسفانه با وجود با مهارت و حرفه بودن پرستار رضایت بنده جلب نشد که بعدا این با مجموعه تماس گرفتم و این موضوع را باهاشون در جریان گذاشتند در اسرع وقت برای پدر بنده پرستار جایگزین و با توجه به سختگیری های که گفته بودم فرستادند.',
    },
];

let randomNumber = Math.floor(Math.random() * allProfileImages.length);

allComments.forEach((comment) => {
    commentSliderWrapper.innerHTML += `
        	<!-- slider item -->
        <div class="swiper-slide">
            <div class="slider-comment-container">
                <!-- header -->
                <div class="slider-comment-header">
                    <img
                    class="slider-comment-profile"
                    src="${allProfileImages[randomNumber]}"
                    alt=""
                    />
                </div>
                <div class="slider-comment-title">${comment.name}</div>
                <span class="slider-comment-icon"
                    ><i class="bi bi-quote"></i
                ></span>
                <!-- user comment -->
                <p class="text-des line-clamp-5">
                  ${comment.des}
                </p>
                </div>
        </div>
    `
})